{"title":"Post Web Design","post_type":"notes","publish_date":"April 4, 2016","body":"<h3 class=\"no-top-margin\">Wordpress Pages and Posts</h3>\n\n<p>When Wordpress was first created it was a blogging engine and there was one type of web entry for users to add, the post. In 2005 Wordpress turned v1.5 and introduced a new type of web entry, the page. Fundamentally they were almost the same thing, except for posts were meant to be blog entries and pages weren’t. They also had more meta data associated with them (date, category, tag) in order to provide more granual queries.</p>\n<p>In 2010 Wordpress brought about the ability to make custom post types, which served as an additional classification system for posts. This ushered a lot of technological improvements that ended up being especially helpful if you were making a website to scale. Within the culture of Wordpress the word “post” ceased to just refer to a “blog post”. “Post” became something more broad, but still not a “page”. From a technical perspective pages actually became posts. Page became a post type.</p>\n<p>If you install Wordpress, you’ll notice that you start off with two post types: Page and Post. This is kind of confusing since “Post” in this context refers to a post type. Yup, that’s right. Pages are a type of post. You can even use <span class=\"bold\">add_post_type_support()</span> function to add features to Pages. </p>\n<p>As of April 2016, <a href=\"http://w3techs.com/technologies/details/cm-wordpress/all/all\" title=\"Usage statistics and market share of WordPress for websites\">26% of websites on the internet now use Wordpress</a>. It’s perhaps because of this that the term “Post” is now equally used as “Page” in the web development community.</p>\n<h3 class=\"no-top-margin\">Page Is Dead</h3>\n\n<p>…for content, at least. </p>\n<p>When someone comes up to you and says, “Hey…check out this <span class=\"bold\">page</span>“ and is clearly referring to a website, this can mean one of three things: They want you to check out the content, they want you to check out the page template, or both. </p>\n<p>When someone comes up to you and says, “Hey..check out this <span class=\"bold\">post</span>“, you know exactly what they mean. They’re pointing to the content. In the modern world of web development, content doesn’t just live in one place anymore. Content is de-centralized. The word “post” signifies the content, not a specific URL or entire web page. I can read a post from my RSS feed reader, a website archive index, or in a more traditional presentation.</p>\n<p>I believe it’s time to embrace the Post. Having “one off pages” with little to no meta data associated with it, outside of a classification system, is lacking in forsight. It may be fine for a website with a few pages on it, but if you grow you’re going to need to scale. And if you scale you’re going to need a proper classification system. And if you have a proper classification system, with meaningful meta data associated with your content for accomplishing your goal, you no longer have pages…you have posts.</p>\n<h3 class=\"no-top-margin\">Developing Post-First</h3>\n\n<p><span class=\"bold\">All content should be able to be viewed by itself.</span></p>\n<p>de-centralized</p>\n"}